Revit 2024 API
BuiltInFailures.EditingFailures.CannotCheckoutWorksets Property
 Can't make workset editable. User '[Borrowers]' has already checked it out.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCheckoutWorksets { get; }
Visual Basic
Public Shared ReadOnly Property CannotCheckoutWorksets As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCheckoutWorksets {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace